get_transactions/logs/getPurchaseData-2021-02-15.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://xmlns.tigo.com/GetPurchaseTransDetailsRequest/V1" xmlns:v3="http://xmlns.tigo.com/RequestHeader/V3" xmlns:v2="http://xmlns.tigo.com/ParameterType/V2" xmlns:cor="http://soa.mic.co.af/coredata_1">
				   <soapenv:Header xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
				      <cor:debugFlag>true</cor:debugFlag>
				      <wsse:Security>
				         <wsse:UsernameToken>
				            <wsse:Username>live_mw_mcontent</wsse:Username>
				            <wsse:Password>P@ssw0rd@12345</wsse:Password>
				         </wsse:UsernameToken>
				      </wsse:Security>
				   </soapenv:Header>
				   <soapenv:Body>
				      <v1:GetPurchaseTransDetailsRequest>
				         <v3:RequestHeader>
				            <v3:GeneralConsumerInformation>
				               <v3:consumerID>MContent</v3:consumerID>
 
				               <v3:transactionID>RhQ4GCs1613428222d181324d034c3b457d77c9b7cb82146d</v3:transactionID>
				               <v3:country>GHA</v3:country>
				               <v3:correlationID>233244262394881202102152230228548107</v3:correlationID>
				            </v3:GeneralConsumerInformation>
				         </v3:RequestHeader>
				         <v1:requestBody>
				            <v1:customerAccount>
				                
				               <v1:msisdn>233277231999</v1:msisdn>
				            </v1:customerAccount>
				            <v1:paymentReference>818664819</v1:paymentReference>
				            <v1:apiType>payment</v1:apiType>
				            <v1:AuthorizationCode>bGl2ZV9td19tY29udGVudFBAc3N3MHJkQDEyMzQ1</v1:AuthorizationCode>
				         </v1:requestBody>
				      </v1:GetPurchaseTransDetailsRequest>
				   </soapenv:Body>
				</soapenv:Envelope>